In [3]:
import pandas as pd

In [4]:
data= pd.read_csv("C:/Users/Balaji/Desktop/sd/StudentsPerformance.csv")

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [6]:
data.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [5]:
data.shape

(1000, 8)

In [11]:
data['reading score'][995]

99

In [12]:
data.at[99,'reading score']

67

In [23]:
#access column wise
data[['reading score','gender']]

     reading score  gender
0               72  female
1               90  female
2               95  female
3               57    male
4               78    male
..             ...     ...
995             99  female
996             55    male
997             71  female
998             78  female
999             86  female

[1000 rows x 2 columns]

In [24]:
#to access row wise
data.loc[100]

gender                                 male
race/ethnicity                      group B
parental level of education    some college
lunch                              standard
test preparation course                none
math score                               79
reading score                            67
writing score                            67
Name: 100, dtype: object

In [27]:
#head tail sample
data.head()
data.tail()
data.sample()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
321,female,group E,high school,standard,none,75,86,79

In [30]:
data.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [40]:
#drop columns
data.drop(columns=['gender'], inplace = True)

In [43]:
#sorting vlues
data.sort_values('math score',ascending = True).head(9)

,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
59,group C,some high school,free/reduced,none,0,17,10
980,group B,high school,free/reduced,none,8,24,23
17,group B,some high school,free/reduced,none,18,32,28
787,group B,some college,standard,none,19,38,32
145,group C,some college,free/reduced,none,22,39,33
842,group B,high school,free/reduced,completed,23,44,36
338,group B,some high school,free/reduced,none,24,38,27
466,group D,associate's degree,free/reduced,none,26,31,38
91,group C,high school,free/reduced,none,27,34,36